## Instructions

1) Lecture and recitations will have most of the codes ( not all) you need for this lab.

2) After finishing the lab, save files as HTML and ipynb. 

3) To submit the lab, go to our course in Canvas --> Assignments --> this lab --> Submit Assignment --> Click "Chose file" --> choose HTML file you saved --> Click another file--> choose ipynb file--submit.

4) Once you submit, download,  and check to ensure that you have submitted the correct files. 

5) When working on the solutions to this lab, please do not display unnecessary data unless we ask you to do that.

6) Please do not share codes or the solutions in the piazza. We can still ask and clarify questions.

7) Write a PM in piazza if you have questions related to the codes.

8) Each problem is worth 10 points.

Load the required packages. Learn more about numpy package here (https://numpy.org/). You do not have to download as it is already included when you downloaded anaconda.

In [69]:
#import packages
import pandas as pd
import numpy as np

### Problem 1. 
Upload the .csv file titanic.csv that came with this HW in the notebook, and name it as titanic. Make sure to import panda as pd and numpy as np.  Those are the necessary packages. Read the details about the titanic data here https://data.world/nrippner/titanic-disaster-dataset. Find out and write some information on this data set such as the dimensions, head, tail etc.

In [1]:
import pandas as pd
import numpy as np

In [2]:
ls

Lab 2.ipynb  Lab.ipynb    titanic

In [3]:
pwd

'/Users/katerynamykhaylova/DS201_Fall_2021/Lab2'

In [10]:
t = pd.read_csv('titanic')

In [11]:
t.dtypes

pclass       float64
survived     float64
name          object
sex           object
age          float64
sibsp        float64
parch        float64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [12]:
t.axes

[RangeIndex(start=0, stop=1310, step=1),
 Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
        'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
       dtype='object')]

In [13]:
print ("Number of dimensions in the object:", t.ndim)
print ("Size of the object:", t.size)
print("Is the object empty?", t.empty)

Number of dimensions in the object: 2
Size of the object: 18340
Is the object empty? False

In [14]:
t.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [15]:
t.tail()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Problem 2. 
 Make a list of variables in the titanic data set. Then classify all the variables as one of discrete, continuous, nominal, and ordinal. Explain how you determined the types of variables.

In [116]:
list(t.columns)

['pclass',
 'survived',
 'name',
 'sex',
 'age',
 'sibsp',
 'parch',
 'ticket',
 'fare',
 'cabin',
 'embarked',
 'boat',
 'body',
 'home.dest']

Discrete: ticket, sibsp, parch, cabin, boat, body number - these numbers can only be counted as a whole number, where it cannot have values in the middle.

Constinuous: age, home.dest, fare - these numbers can represent any values in the range.

Nominal: sex, survived, name, embarked - these can be unordered and they are exclusive

Ordinal: pclass - these categories are ordered and are exclusive

### Problem 3. 
 Learn more about isnull() or isna() function  here https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.isnull.html and use it to find how many missing values does each variable has. Find out which three variables have the most missing values, remove them from the data frame, and name the new data frame as titanic1.

In [32]:
t.isnull().sum()

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

The variables with the most missing values are cabin, boat, and body.

In [39]:
titanic1 = t[t.columns[[0,1,2,3,4,5,6,7,8,10,13]]]

In [46]:
titanic1.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'embarked', 'home.dest'],
      dtype='object')

### Problem 4. 
Filter the titanic1 data with and operator. https://kanoki.org/2020/01/21/pandas-dataframe-filter-with-multiple-conditions/

a) How many passengers who paid less than the average fare survived?

In [62]:
Sum = titanic1.sum(axis = 0, skipna = True)

In [ ]:
print (Sum)

In [69]:
Av = Sum.div(len(titanic1))

In [ ]:
print (Av)

In [90]:
titanic1.loc[(titanic1["fare"] <= 33.245) & (titanic1["survived"] == 1.0)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,home.dest
5,1.0,1.0,"Anderson, Mr. Harry",male,48.0,0.0,0.0,19952,26.5500,S,"New York, NY"
14,1.0,1.0,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0.0,0.0,27042,30.0000,S,"Hessle, Yorks"
22,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0,0.0,0.0,111369,30.0000,C,"New York, NY"
29,1.0,1.0,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.0,0.0,0.0,110564,26.5500,S,"Stockholm, Sweden / Washington, DC"
31,1.0,1.0,"Blank, Mr. Henry",male,40.0,0.0,0.0,112277,31.0000,C,"Glen Ridge, NJ"
...,...,...,...,...,...,...,...,...,...,...,...
1261,3.0,1.0,"Turkula, Mrs. (Hedwig)",female,63.0,0.0,0.0,4134,9.5875,S,NaN
1277,3.0,1.0,"Vartanian, Mr. David",male,22.0,0.0,0.0,2658,7.2250,C,NaN
1286,3.0,1.0,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0.0,0.0,2688,7.2292,C,NaN
1290,3.0,1.0,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1.0,0.0,363272,7.0000,S,NaN
1300,3.0,1.0,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1.0,0.0,2659,14.4542,C,NaN

319 passengers who paid less than the average have survived.

b) Did a passenger who embarked journey from Queenstown and was of 40 years of age survive?

In [79]:
titanic1.loc[(titanic1["embarked"] == 'Q') & (titanic1["age"] == 40.0)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,home.dest
683,3.0,0.0,"Bourke, Mr. John",male,40.0,1.0,1.0,364849,15.5,Q,"Ireland Chicago, IL"

The passenger from Queenstown who was 40 did not survive.

### Problem 5. 
Continuing with the titanic1 data set, answer the following questions.
Use groupby function to find out how many passengers were in each class. https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html

In [93]:
titanic1.groupby(by=["pclass"]).size()

pclass
1.0    323
2.0    277
3.0    709
dtype: int64

In first class there were 323 passengers, in second there were 277 passengers, and in third there were 709 passengers.